Revit 2026 API

# AdvancedMetalMetalF0 Property

---

The property labeled "Reflectance" from the "AdvancedMetal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalF0 { get; }
```
```vb
Public Shared ReadOnly Property MetalF0 As String
	Get
```
```cpp
public:
static property String^ MetalF0 {
	String^ get ();
}
```
```fsharp
static member MetalF0 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

AdvancedMetal Class

Autodesk.Revit.DB.Visual Namespace